app/controllers/line_items_controller.rb

  def show
    @line_item = LineItem.find(params[:id])
---
SELECT * FROM "line_items" WHERE ("line_items"."id" = 1)

  def edit
    @line_item = LineItem.find(params[:id])
---
SELECT * FROM "line_items" WHERE ("line_items"."id" = 1)

  def update
    @line_item = LineItem.find(params[:id])
---
SELECT * FROM "line_items" WHERE ("line_items"."id" = 1)