app/controllers/orders_controller.rb

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 12)

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 12)

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT * FROM "orders" WHERE ("orders"."id" = 12)
DELETE FROM "orders" WHERE "id" = 12