app/controllers/store_controller.rb

  def index
	@products = Product.find_products_for_sale
---
SELECT * FROM `products` ORDER BY title

  def add_to_cart
	product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def decrease_cart_item
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 8)

  def save_order
	#@cart = find_cart
	@order = Order.new(params[:order])
	@order.add_line_items_from_cart(@cart)
	if @order.save
---
INSERT INTO `line_items` (`order_id`, `updated_at`, `total_price`, `created_at`, `quantity`, `product_id`) VALUES(1, '2012-04-06 06:57:25', 29.95, '2012-04-06 06:57:25', 1, 1)
INSERT INTO `orders` (`updated_at`, `pay_type`, `email`, `name`, `address`, `created_at`) VALUES('2012-04-06 06:57:25', 'Credit card', 'linsword20@gmail.com', 'lin', 'bupt', '2012-04-06 06:57:25')