app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all,:order => :name)

SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
---
  def show
    @users = User.find(:all, :order => :name)

INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('lin', '40.586447634298027', '2012-03-05 03:23:57', '2012-03-05 03:23:57', '38a734cc979ea1eb65ee326e4576f37855b0175c')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy